<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"010acd37aa1475c8a342b001bf8869bdd6387bd16930a0b42def2e07d05e8d32","plan_job_ref":"Job Create MPE Management terraform plan #80 at https://github.com/AFMPE/mpe_management/actions/runs/4846333334","plan_hash":"a1fd152fa041671ab22ab1b74d21b942244672b46f3f3228e42cc17f09f60969","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=core-mgt-prod-tfstate            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `src/tfvars/production/parameters.prod.tfvars
`<details open><summary>With variables</summary>

```hcl
state_sa_container_name           = (sensitive value)
state_sa_name                     = (sensitive value)
state_sa_rg                       = (sensitive value)
subscription_id_hub               = (sensitive value)
subscription_id_internal          = (sensitive value)
subscription_id_partners_gsa_dev  = (sensitive value)
subscription_id_partners_gsa_prod = (sensitive value)
subscription_id_sandbox           = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 2 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_sentinel_rule_alerts.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_alert_rule_scheduled.sentinel_alert["User_Account_Was_Locked_O365"] will be created
  + resource "azurerm_sentinel_alert_rule_scheduled" "sentinel_alert" {
      + display_name               = "User_Account_Was_Locked_O365"
      + enabled                    = true
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "User_Account_Was_Locked_O365"
      + query                      = <<-EOT
            OfficeActivity 
            | where Operation == "UserLoginFailed" | where * contains "IdsLocked"
        EOT
      + query_frequency            = "PT5H"
      + query_period               = "PT5H"
      + severity                   = "Medium"
      + suppression_duration       = "PT5H"
      + suppression_enabled        = false
      + tactics                    = [
          + "CredentialAccess",
        ]
      + techniques                 = [
          + "T1110",
        ]
      + trigger_operator           = "GreaterThan"
      + trigger_threshold          = 0

      + entity_mapping {
          + entity_type = "IP"

          + field_mapping {
              + column_name = "ClientIP"
              + identifier  = "Address"
            }
        }

      + event_grouping {
          + aggregation_method = "SingleAlert"
        }

      + incident_configuration {
          + create_incident = true

          + grouping {
              + enabled                 = false
              + entity_matching_method  = "AllEntities"
              + group_by_alert_details  = [
                  + "Severity",
                ]
              + group_by_entities       = []
              + lookback_duration       = "P1D"
              + reopen_closed_incidents = false
            }
        }
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_microsoft_threat_intelligence.dataMTI must be replaced
-/+ resource "azurerm_sentinel_data_connector_microsoft_threat_intelligence" "dataMTI" {
      + bing_safety_phishing_url_lookback_date       = "1970-01-01T00:00:00Z" # forces replacement
      ~ id                                           = "*************************************************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name                                         = "MSTI_Connector"
      ~ tenant_id                                    = "************************************" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["StorageAccounts"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/StorageAccounts"
      - subplan       = "PerTransaction" -> null
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["VirtualMachines"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/VirtualMachines"
      - subplan       = "P2" -> null
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #80](https://github.com/AFMPE/mpe_management/actions/runs/4846333334)